 * This notebook is for the course : 5-week Data Science Bootcamp by dPhi
 * As per content of week1, the course curators shared some content for pandas, here is my ipynb for the same
 * The notebook (https://dphi.tech/learn/5-week_Data_Science_Bootcamp/week-1/205/notebook-introduction-to-pandas) had some exercises which I've tried to solve :)

In [79]:
import pandas as pd
import numpy as np

<h3>Exercise 1

In [80]:
lst1 = [1, 2, 3, 5, 8]
lst2 = [8, 5, 3, 2, 1]
s1=pd.Series(lst1)
s2=pd.Series(lst2)
s3_add=s1+s2
s3_diff=s1-s2
s3_mul=s1*s2
s3_div=s1/s2

print('Addition :')
print(s3_add)

print('Subtraction :')
print(s3_diff)

print('Multiplication :')
print(s3_mul)

print('Division : ')
print(s3_div)

Addition :
0    9
1    7
2    6
3    7
4    9
dtype: int64
Subtraction :
0   -7
1   -3
2    0
3    3
4    7
dtype: int64
Multiplication :
0     8
1    10
2     9
3    10
4     8
dtype: int64
Division :
0    0.125
1    0.400
2    1.000
3    2.500
4    8.000
dtype: float64

<h3> Exercise 2

In [81]:
Amazon_Reviews=pd.Series([45000,37872,57923,68979,78934,69897,56701])
Amazon_Reviews

0    45000
1    37872
2    57923
3    68979
4    78934
5    69897
6    56701
dtype: int64

In [82]:
# Get the last three values from Amazon_Reviews using negative indexing.
print(Amazon_Reviews[-3:])

4    78934
5    69897
6    56701
dtype: int64

<h3> Exercise 3 </h3>
 * Create a Series using the given dictionary
 * Extract areas for 'Texas', 'New York', and 'Florida' from the created series

In [83]:
area_dict = {'Cali': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995,'Mumbai':2323,'Thane':5435,'Delhi':455544}
# series as a specialized dict
area=pd.Series(area_dict)
print(area)
print()
print('Area of Texas, New York and Florida are',area['Texas'],area['New York'],area['Florida'],'respectively')

Cali        423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995
Mumbai        2323
Thane         5435
Delhi       455544
dtype: int64

Area of Texas, New York and Florida are 695662 141297 170312 respectively

In [84]:
#slicing
print(area['Cali':'Mumbai'])

Cali        423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995
Mumbai        2323
dtype: int64

<h3>Exercise 5

Tasks :
 * Create a Dataframe object which contains all the lists values as Series. 
 * Delete the rows which contains missing values
 * Capitalize all the continents in continent column.
 * Get the length of each country's names.

In [85]:
country = ['Netherland', 'Germany', 'Peru', 'Israel', 'Madagascar']
year = [2002, 2002, 1957, 2007, 1967]
area = [16122830.0, np.nan, 9146100.0, 6426679.0, 6334556.0]
continent = ['Europe', 'europe', 'Americas', 'asia', 'Africa']

In [86]:
#Creating dataframe from multiple lists
country_info=pd.DataFrame(list(zip(country,year,area,continent)))
print(country_info)

            0     1           2         3
0  Netherland  2002  16122830.0    Europe
1     Germany  2002         NaN    europe
2        Peru  1957   9146100.0  Americas
3      Israel  2007   6426679.0      asia
4  Madagascar  1967   6334556.0    Africa

In [87]:
#changing column names
country_info = country_info.rename(columns={0:'Country',1:'Year',2:'Income',3:'Continent'})
print(country_info)

      Country  Year      Income Continent
0  Netherland  2002  16122830.0    Europe
1     Germany  2002         NaN    europe
2        Peru  1957   9146100.0  Americas
3      Israel  2007   6426679.0      asia
4  Madagascar  1967   6334556.0    Africa

In [88]:
#Deleting rows with missing values
country_info=country_info.dropna()
country_info

      Country  Year      Income Continent
0  Netherland  2002  16122830.0    Europe
2        Peru  1957   9146100.0  Americas
3      Israel  2007   6426679.0      asia
4  Madagascar  1967   6334556.0    Africa

In [89]:
#Capitalize continent name
country_info['Continent']=country_info['Continent'].str.capitalize()
print(country_info)

      Country  Year      Income Continent
0  Netherland  2002  16122830.0    Europe
2        Peru  1957   9146100.0  Americas
3      Israel  2007   6426679.0      Asia
4  Madagascar  1967   6334556.0    Africa

In [90]:
#To get length of each country's name
for z in country_info['Country']:
    print('Length of country name : '+z+' => ' +str(len(z)))

Length of country name : Netherland => 10
Length of country name : Peru => 4
Length of country name : Israel => 6
Length of country name : Madagascar => 10

<h3> Exercise 6 </h3>

 * Create a Dataframe object which contains all the lists values as Series. 
 * The final DataFrame should be named as country_gdp, containing 2 columns and 5 rows.
 * Concatenate the two dataframes: country_info and country_gdp with axis=0 and name it concat_data
 * Check if there are any null values in concat_data
 * Find total numer of missing values in each column. hint: Use .isnull() and .sum() functions

In [91]:
country = ['Netherland', 'Germany', 'Peru', 'Israel', 'Madagascar']
gdp_per_cap = [33724.757780, 30035.801980, 4245.256698, 25523.277100, 1634.047282]
country_gdp=pd.DataFrame(list(zip(country,gdp_per_cap)))

#renaming for making it easy to read
country_gdp = country_gdp.rename(columns={0:'Country',1:'Paisa'})

country_gdp

      Country         Paisa
0  Netherland  33724.757780
1     Germany  30035.801980
2        Peru   4245.256698
3      Israel  25523.277100
4  Madagascar   1634.047282

In [92]:
s1=pd.Series(country)
s2=pd.Series(gdp_per_cap)
concat_data=pd.concat([s1,s2], axis=0)
concat_data

0     Netherland
1        Germany
2           Peru
3         Israel
4     Madagascar
0    33724.75778
1    30035.80198
2    4245.256698
3     25523.2771
4    1634.047282
dtype: object

In [93]:
#Checking for null values in dataframe
country_gdp.isnull().sum()

Country    0
Paisa      0
dtype: int64

In [94]:
#Checking for null values in series
print('The number of null/nan entries in the dataset is :',concat_data.isnull().sum())

The number of null/nan entries in the dataset is : 0